tests/Amadeus/Client/Session/Handler/testfiles/soapheader2/dummySecurityAuth.txt

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://xml.amadeus.com/VLSSLQ_06_1_1A"><SOAP-ENV:Body><ns1:Security_Authenticate><ns1:userIdentifier><ns1:originIdentification><ns1:sourceOffice>BRUXX0000</ns1:sourceOffice></ns1:originIdentification><ns1:originatorTypeCode>U</ns1:originatorTypeCode><ns1:originator>DUMMYORIG</ns1:originator></ns1:userIdentifier><ns1:dutyCode><ns1:dutyCodeDetails><ns1:referenceQualifier>DUT</ns1:referenceQualifier><ns1:referenceIdentifier>SU</ns1:referenceIdentifier></ns1:dutyCodeDetails></ns1:dutyCode><ns1:systemDetails><ns1:organizationDetails><ns1:organizationId>DUMMYORG</ns1:organizationId></ns1:organizationDetails></ns1:systemDetails><ns1:passwordInfo><ns1:dataLength>12</ns1:dataLength><ns1:dataType>E</ns1:dataType><ns1:binaryData>dGhlIHBhc3N3b3Jk</ns1:binaryData></ns1:passwordInfo></ns1:Security_Authenticate></SOAP-ENV:Body></SOAP-ENV:Envelope>